jake-emacs/init.org
#+TITLE: Jake B's Emacs Config
:PROPERTIES:
#+AUTHOR: Jake B
#+STARTUP: fold
#+PROPERTY: header-args :results silent :tangle yes
#+HTML_HEAD: <link rel="stylesheet" href="https://sandyuraz.com/styles/org.min.css">
#+SEQ_TODO: TODO(t) | DISABLED(d)
:END:


* Things to do
:PROPERTIES:
:VISIBILITY: all
:END:

* Meta
This file contains my Emacs configuration. I have roughly ordered the org headings in order of importance/reliability. For example, misc packages is loaded last as I try new stuff there. Keyboard section is also important as if there's error I feel comfortable enough to go fix it.

** Dependencies
Here is a list of programs I have installed for Emacs. They are not all explicitly required, however.

+ emacs-plus (built with xwidgets) (~brew install emacs-plus@28 --with-xwidgets --with-native-comp~)
+ ripgrep (rg) (faster grep)
+ fzf (fuzzy file search)
+ fd (faster find)
+ shellcheck (syntax checking for sh)
+ gnu coreutils (gls, ggrep, etc)
+ aspell (spellchecking)
  
** Exported file note
The following is exported to the top of the tangled init.el file as a note.
#+BEGIN_SRC emacs-lisp 
  ;; -*- lexical-binding: t; -*-
  ;;; 
  ;;; Jake B's Emacs Configuration
  ;;;

  ;; Copyright (C) Jake B
  ;; Author: Jake B <jakebox0@protonmail.com>
  ;; URL: https://github.com/jakebox/.emacs
  ;; This file is not part of GNU Emacs.
  ;; This file is free software.

  ;; ------- The following code was auto-tangled from an Orgmode file. ------- ;;

#+END_SRC

* Startup
** Early-Init
Starting in Emacs 27 the early-init.el file is run before the GUI is created, so we take care of a few misc. GUI features. Keeps ugliness down and should help startup time, too.
#+BEGIN_SRC emacs-lisp :tangle ./early-init.el
  ;; -*- lexical-binding: t; -*-

  ;; -------------------------------------------------------------------------------- ;;
  ;; This early-init.el file was auto-tangled from an orgmode file. (C) Jake B        ;;
  ;; -------------------------------------------------------------------------------- ;;

  ;; Garbage Collections
  (setq gc-cons-percentage 0.6)

  ;; Compile warnings
  ;;  (setq warning-minimum-level :emergency)
  (setq native-comp-async-report-warnings-errors 'silent) ;; native-comp warning
  (setq byte-compile-warnings '(not free-vars unresolved noruntime lexical make-local))


  ;; MISC OPTIMIZATIONS ----
  ;;; optimizations (froom Doom's core.el). See that file for descriptions.
  (setq idle-update-delay 1.0)

  ;; Disabling bidi (bidirectional editing stuff)
  (setq-default bidi-display-reordering 'left-to-right 
                bidi-paragraph-direction 'left-to-right)
  (setq bidi-inhibit-bpa t)  ; emacs 27 only - disables bidirectional parenthesis

  (setq-default cursor-in-non-selected-windows nil)
  (setq highlight-nonselected-windows nil)
  (setq fast-but-imprecise-scrolling t)
  (setq inhibit-compacting-font-caches t)
#+END_SRC
** Packages
#+BEGIN_SRC emacs-lisp 
  (require 'package)

  (setq package-user-dir (expand-file-name "elpa" user-emacs-directory))

  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/")) ;; ELPA and NonGNU ELPA are default in Emacs28

  (setq gnutls-algorithm-priority "NORMAL:-VERS-TLS1.3") ;; w/o this Emacs freezes when refreshing ELPA

  (package-initialize)
  (setq package-enable-at-startup nil)

  (require 'use-package)
  (setq use-package-always-ensure t)
  (setq use-package-verbose nil)
#+END_SRC
https://jwiegley.github.io/use-package/keywords/
** Garbage Collections/Collector
#+BEGIN_SRC emacs-lisp 
  (use-package gcmh
    :diminish gcmh-mode
    :config
    (setq gcmh-idle-delay 5
          gcmh-high-cons-threshold (* 16 1024 1024))  ; 16mb
    (gcmh-mode 1))

  (add-hook 'emacs-startup-hook
            (lambda ()
              (setq gc-cons-percentage 0.1))) ;; Default value for `gc-cons-percentage'

  (add-hook 'emacs-startup-hook
            (lambda ()
              (message "Emacs ready in %s with %d garbage collections."
                       (format "%.2f seconds"
                               (float-time
                                (time-subtract after-init-time before-init-time)))
                       gcs-done)))
          #+END_SRC
          
* Files, variables, etc
** Setting custom variables
I keep all of my Emacs configuration files and org files in Dropbox. To keep
stuff clean and to make it easier to move stuff around in the future I set a
bunch of variables up here that can be used later.
#+BEGIN_SRC emacs-lisp 
  (load (expand-file-name "jib-variables.el" user-emacs-directory))

  ;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; Calculated variables ;;
  ;;;;;;;;;;;;;;;;;;;;;;;;;;

  ;; Set `jib/computer' to 'laptop or 'desktop.
  (let ((sys (system-name)))
    (if (or (string= sys "MJBs-MacBook-Air.local") (string= sys "mjbs-air.lan"))
        (setq jib/computer 'laptop)
      (setq jib/computer 'desktop)))
#+END_SRC
** Loading custom lisp files
#+BEGIN_SRC emacs-lisp 
  (load (expand-file-name "jib-funcs.el" user-emacs-directory))
  (load (expand-file-name "private.el" user-emacs-directory))
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))

  (load custom-file)

  ;; I put mostly stuff I find online in this "lisp" folder in my emacs-stuff.
  ;; Add every directory in that folder to the load-path.
  (let ((default-directory (directory-file-name (concat jib/emacs-stuff "/lisp"))))
    (normal-top-level-add-subdirs-to-load-path))

  (require 'on) ;; on.el – utility hooks and functions from Doom Emacs
#+END_SRC
** Registers
#+BEGIN_SRC emacs-lisp 
  (setq register-preview-delay 0) ;; Show registers ASAP

  (set-register ?i (cons 'file (concat org-directory   "/cpb.org")))
  (set-register ?h (cons 'file (concat org-directory   "/work.org")))
  (set-register ?C (cons 'file (concat jib/emacs-stuff "/jake-emacs/init.org")))
  (set-register ?A (cons 'file (concat org-directory   "/org-archive/homework-archive.org_archive")))
  (set-register ?T (cons 'file (concat org-directory   "/org-archive/todo-archive.org_archive")))
#+END_SRC
** Path
Pretty sure this isn't the proper way to do it and that I should be using ~exec-path-from-shell~, but it works and I don't see this changing. So it's fine.
#+BEGIN_SRC emacs-lisp 
  (setq exec-path '("/usr/local/Cellar/pyenv-virtualenv/1.1.5/shims"
                    "/Users/jake/.pyenv/shims" "/usr/local/bin" "/bin"
                    "/usr/bin" "/usr/sbin" "/usr/local/sbin" "/sbin"
                    "/Users/jake/bin" "/Users/jake/doom-emacs/bin"
                    "/Library/TeX/texbin"))

  (setenv "PATH" "/usr/local/Cellar/pyenv-virtualenv/1.1.5/shims:/Users/jake/.pyenv/shims:/usr/local/bin:/bin:/usr/bin:/usr/sbin:/usr/local/sbin:/sbin:/Users/jake/bin:/Users/jake/doom-emacs/bin:/Library/TeX/texbin")

  (setq insert-directory-program "/usr/local/bin/gls")

  (setq browse-url-firefox-program "/Applications/Firefox.app/Contents/MacOS/firefox")
  (setq browse-url-chrome-program "/Applications/Google Chrome.app/Contents/MacOS/Google Chrome")
#+END_SRC

* General configuration
General configurations and optimizations/better defaults.
#+BEGIN_SRC emacs-lisp 
  (server-start)

  ;; A cool mode to revert window configurations.
  (winner-mode 1)

  ;; INTERACTION -----

  ;; When emacs asks for "yes" or "no", let "y" or "n" suffice
  (setq use-short-answers t)

  ;; Confirm to quit
  (setq confirm-kill-emacs 'yes-or-no-p)

  ;; Major mode of new buffers
  (setq initial-major-mode 'org-mode)

  ;; WINDOW -----------

  ;; Don't resize the frames in steps; it looks weird, especially in tiling window
  ;; managers, where it can leave unseemly gaps.
  (setq frame-resize-pixelwise t)

  ;; When opening a file (like double click) on Mac, use an existing frame
  (setq ns-pop-up-frames nil)

  ;; But do not resize windows pixelwise, this can cause crashes in some cases
  ;; where we resize windows too quickly.
  (setq window-resize-pixelwise nil)

  ;; LINES -----------
  (setq-default truncate-lines t)

  (setq-default tab-width 4)

  (setq-default fill-column 80)

  (use-package paren
    ;; highlight matching delimiters
    :ensure nil
    :config
    (setq show-paren-delay 0.1
          show-paren-highlight-openparen t
          show-paren-when-point-inside-paren t
          show-paren-when-point-in-periphery t)
    (show-paren-mode 1))


  (setq sentence-end-double-space nil) ;; Sentences end with one space

  (setq bookmark-fontify nil)

  ;; SCROLLING ---------
  ;; (setq mouse-wheel-scroll-amount '(1 ((shift) . 5) ((control) . nil)))
  (setq scroll-conservatively 101)


  (setq
   ;; If the frame contains multiple windows, scroll the one under the cursor
   ;; instead of the one that currently has keyboard focus.
   mouse-wheel-follow-mouse 't
   ;; Completely disable mouse wheel acceleration to avoid speeding away.
   mouse-wheel-progressive-speed nil
   ;; The most important setting of all! Make each scroll-event move 2 lines at
   ;; a time (instead of 5 at default). Simply hold down shift to move twice as
   ;; fast, or hold down control to move 3x as fast. Perfect for trackpads.
   mouse-wheel-scroll-amount '(2 ((shift) . 4) ((control) . 6)))

  ;; sane trackpad/mouse scroll settings (doom)
  (setq mac-redisplay-dont-reset-vscroll t
        mac-mouse-wheel-smooth-scroll nil)

  (setq visible-bell nil) ;; Make it ring (so no visible bell) (default)
  (setq ring-bell-function 'ignore) ;; BUT ignore it, so we see and hear nothing

  (setq line-move-visual t) ;; C-p, C-n, etc uses visual lines

  ;; Blank scratch buffer
  (setq initial-scratch-message "")

  ;; Uses system trash rather than deleting forever
  (setq trash-directory (concat jib/home ".Trash"))
  (setq delete-by-moving-to-trash t)

  ;; Try really hard to keep the cursor from getting stuck in the read-only prompt
  ;; portion of the minibuffer.
  (setq minibuffer-prompt-properties '(read-only t intangible t cursor-intangible t face minibuffer-prompt))
  (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)

  ;; Explicitly define a width to reduce the cost of on-the-fly computation
  (setq-default display-line-numbers-width 3)

  ;; When opening a symlink that links to a file in a git repo, edit the file in the
  ;; git repo so we can use the Emacs vc features (like Diff) in the future
  (setq vc-follow-symlinks t)

  ;; BACKUPS/LOCKFILES --------
  ;; Don't generate backups or lockfiles.
  (setq create-lockfiles nil
        make-backup-files nil
        ;; But in case the user does enable it, some sensible defaults:
        version-control t     ; number each backup file
        backup-by-copying t   ; instead of renaming current file (clobbers links)
        delete-old-versions t ; clean up after itself
        kept-old-versions 5
        kept-new-versions 5
        backup-directory-alist (list (cons "." (concat user-emacs-directory "backup/"))))

  (use-package recentf
    :ensure nil
    :config
    (setq ;;recentf-auto-cleanup 'never
     ;; recentf-max-menu-items 0
     recentf-max-saved-items 200)
    ;; Show home folder path as a ~
    (setq recentf-filename-handlers  
          (append '(abbreviate-file-name) recentf-filename-handlers))
    (recentf-mode))

  (require 'uniquify)
  (setq uniquify-buffer-name-style 'forward)

  ;; ENCODING -------------
  (when (fboundp 'set-charset-priority)
    (set-charset-priority 'unicode))       ; pretty
  (prefer-coding-system 'utf-8)            ; pretty
  (setq locale-coding-system 'utf-8)       ; please

  (setq default-input-method "spanish-postfix") ;; When I need to type in Spanish (switch with C-\)


  (setq blink-cursor-interval 0.6)
  (blink-cursor-mode 0)

  (setq save-interprogram-paste-before-kill t
        apropos-do-all t
        mouse-yank-at-point t)

  ;; Weird thing where `list-colors-display` doesn't show all colors.
  ;; https://bug-gnu-emacs.gnu.narkive.com/Bo6OdySs/bug-5683-23-1-93-list-colors-display-doesn-t-show-all-colors
  (setq x-colors (ns-list-colors))

  ;; How thin the window should be to stop splitting vertically (I think)
  (setq split-width-threshold 80)

  (setq dired-kill-when-opening-new-dired-buffer t)
#+END_SRC

* Keyboard
** Mac Configuration/Compatibility
Use ~command~ (⌘) as ~meta~ in macOS. Disable option (aka alt). Keep control ctrl. Right command turns into super (s-), and right control becomes hyper (H-). Finally, make escape quit on the first press (rather than 3, as I think it would be otherwise).

Goes to early-init so if I have an error in my init I have keybinds I am used to.
#+BEGIN_SRC emacs-lisp :tangle ./early-init.el
  (setq mac-command-modifier       'meta
        mac-option-modifier         nil
        mac-control-modifier       'control
        mac-right-command-modifier 'super
        mac-right-control-modifier 'hyper)

  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+END_SRC
** Which-key
#+BEGIN_SRC emacs-lisp 
  (use-package which-key
    :diminish which-key-mode
    :init
    (which-key-mode)
    (which-key-setup-minibuffer)
    :config
    (setq which-key-idle-delay 0.3)
    (setq which-key-prefix-prefix "◉ ")
    (setq which-key-sort-order 'which-key-key-order-alpha
          which-key-min-display-lines 6
          which-key-max-display-columns nil))
#+END_SRC
