jake-emacs/init.org
*** Company
Company provides autosuggestion/completion in buffers (writing code, pathing to files, etc). 
#+BEGIN_SRC emacs-lisp
  (use-package company
    :diminish company-mode
    :general
    (general-define-key :keymaps 'company-active-map
                        "C-j" 'company-select-next
                        "C-k" 'company-select-previous)
    :init
    ;; These configurations come from Doom Emacs:
    (add-hook 'after-init-hook 'global-company-mode)
    (setq company-minimum-prefix-length 2
          company-tooltip-limit 14
          company-tooltip-align-annotations t
          company-require-match 'never
          company-global-modes '(not erc-mode message-mode help-mode gud-mode)
          company-frontends
          '(company-pseudo-tooltip-frontend  ; always show candidates in overlay tooltip
            company-echo-metadata-frontend)  ; show selected candidate docs in echo area
          company-backends '(company-capf company-files company-keywords)
          company-auto-complete nil
          company-auto-complete-chars nil
          company-dabbrev-other-buffers nil
          company-dabbrev-ignore-case nil
          company-dabbrev-downcase nil)

    :config
    (setq company-idle-delay 0.35)
    :custom-face
    (company-tooltip ((t (:family "Roboto Mono")))))
#+END_SRC
*** Ivy
#+BEGIN_SRC emacs-lisp
  (use-package ivy
    :diminish ivy-mode
    :config
    (setq ivy-extra-directories nil) ;; Hides . and .. directories
    (setq ivy-initial-inputs-alist nil) ;; Removes the ^ in ivy searches
    (if (eq jib/computer 'laptop)
        (setq-default ivy-height 10)
      (setq-default ivy-height 15))
    (setq ivy-fixed-height-minibuffer t)
    (ivy-mode 1)

    ;; Shows a preview of the face in counsel-describe-face
    (add-to-list 'ivy-format-functions-alist '(counsel-describe-face . counsel--faces-format-function))

    :general
    (general-define-key
     ;; Also put in ivy-switch-buffer-map b/c otherwise switch buffer map overrides and C-k kills buffers
     :keymaps '(ivy-minibuffer-map ivy-switch-buffer-map)
     "S-SPC" 'nil
     "C-SPC" 'ivy-restrict-to-matches ;; Default is S-SPC, changed this b/c sometimes I accidentally hit S-SPC
     ;; C-j and C-k to move up/down in Ivy
     "C-k" 'ivy-previous-line
     "C-j" 'ivy-next-line)
    )

  ;; Nice icons in Ivy. Replaces all-the-icons-ivy.
  (use-package all-the-icons-ivy-rich
    :init (all-the-icons-ivy-rich-mode 1)
    :config
    (setq all-the-icons-ivy-rich-icon-size 1.0))

  (use-package ivy-rich
    :after ivy
    :init
    (setq ivy-rich-path-style 'abbrev)
    (setcdr (assq t ivy-format-functions-alist) #'ivy-format-function-line)
    :config
    (ivy-rich-mode 1))

#+END_SRC
*** Counsel
#+BEGIN_SRC emacs-lisp
  (use-package counsel
    :config
    (setq default-directory jib/home)
    (setq counsel-switch-buffer-preview-virtual-buffers nil) ;; Removes recentfiles/bookmarks from counsel-switch-buffer
    (setq counsel-find-file-ignore-regexp
          (concat
           ;; That weird Icon? file in Dropbox.
           "\\(Icon\\\)"
           ;; Hides file names beginning with # or .
           "\\|\\(?:\\`[#.]\\)"))

    ;; emacs regexp notes: had to put \\| before the second regexp to make this work

    ;; Sorts counsel-recentf in order of time last accessed
    (add-to-list 'ivy-sort-functions-alist
                 '(counsel-recentf . file-newer-than-file-p))

    (add-to-list 'recentf-exclude
                 (expand-file-name "projectile-bookmarks.eld" user-emacs-directory))

    (setq-default counsel--fzf-dir jib/home)
    :general
    (general-define-key :keymaps 'counsel-find-file-map
                        "C-c f" 'counsel-file-jump-from-find) ;; when in counsel-find-file, run this to search the whole directory recursively
    )
#+END_SRC
*** Prescient
#+BEGIN_SRC emacs-lisp
  (use-package prescient
    :config
    (setq-default history-length 1000)
    (setq-default prescient-history-length 1000) ;; More prescient history
    (prescient-persist-mode +1))

  ;; Use `prescient' for Ivy menus.
  (use-package ivy-prescient
    :after ivy
    :config
    ;; don't prescient sort these commands
    (dolist (command '(org-ql-view counsel-find-file))
      (setq ivy-prescient-sort-commands (append ivy-prescient-sort-commands (list command))))
    (ivy-prescient-mode +1))

  (use-package company-prescient
    :defer 2
    :after company
    :config
    (company-prescient-mode +1))
#+END_SRC
** Smartparens
Most of this configuration is from Doom Emacs' [[https://github.com/hlissner/doom-emacs/blob/develop/core/core-editor.el][core-editor.el]]. For some reason smartparens is sort of confusing to configure (at least to me!)
#+BEGIN_SRC emacs-lisp 
  (use-package smartparens
    :diminish smartparens-mode
    :defer 1
    :config
    ;; Load default smartparens rules for various languages
    (require 'smartparens-config)
    (setq sp-max-prefix-length 25)
    (setq sp-max-pair-length 4)
    (setq sp-highlight-pair-overlay nil
          sp-highlight-wrap-overlay nil
          sp-highlight-wrap-tag-overlay nil)

    (with-eval-after-load 'evil
      (setq sp-show-pair-from-inside t)
      (setq sp-cancel-autoskip-on-backward-movement nil)
      (setq sp-pair-overlay-keymap (make-sparse-keymap)))

    (let ((unless-list '(sp-point-before-word-p
                         sp-point-after-word-p
                         sp-point-before-same-p)))
      (sp-pair "'"  nil :unless unless-list)
      (sp-pair "\"" nil :unless unless-list))

    ;; In lisps ( should open a new form if before another parenthesis
    (sp-local-pair sp-lisp-modes "(" ")" :unless '(:rem sp-point-before-same-p))

    ;; Don't do square-bracket space-expansion where it doesn't make sense to
    (sp-local-pair '(emacs-lisp-mode org-mode markdown-mode gfm-mode)
                   "[" nil :post-handlers '(:rem ("| " "SPC")))


    (dolist (brace '("(" "{" "["))
      (sp-pair brace nil
               :post-handlers '(("||\n[i]" "RET") ("| " "SPC"))
               ;; Don't autopair opening braces if before a word character or
               ;; other opening brace. The rationale: it interferes with manual
               ;; balancing of braces, and is odd form to have s-exps with no
               ;; whitespace in between, e.g. ()()(). Insert whitespace if
               ;; genuinely want to start a new form in the middle of a word.
               :unless '(sp-point-before-word-p sp-point-before-same-p)))
    (smartparens-global-mode t))
#+END_SRC
** Spellcheck
Enable Flyspell (spellchecking) in these modes. Requires ~aspell~ to be installed.
#+BEGIN_SRC emacs-lisp 
  ;; "Enable Flyspell mode, which highlights all misspelled words. "
  (use-package flyspell
    :defer t
    :config

    (add-to-list 'ispell-skip-region-alist '("~" "~"))
    (add-to-list 'ispell-skip-region-alist '("=" "="))
    (add-to-list 'ispell-skip-region-alist '("^#\\+BEGIN_SRC" . "^#\\+END_SRC"))
    (add-to-list 'ispell-skip-region-alist '("^#\\+BEGIN_EXPORT" . "^#\\+END_EXPORT"))
    (add-to-list 'ispell-skip-region-alist '("^#\\+BEGIN_EXPORT" . "^#\\+END_EXPORT"))
    (add-to-list 'ispell-skip-region-alist '(":\\(PROPERTIES\\|LOGBOOK\\):" . ":END:"))

    (dolist (mode '(org-mode-hook
                    mu4e-compose-mode-hook))
      (add-hook mode (lambda () (flyspell-mode 1))))

    (setq ispell-extra-args '("--sug-mode=ultra"))

    (setq flyspell-issue-welcome-flag nil
          flyspell-issue-message-flag nil)

    :general ;; Switches correct word from middle click to right click
    (general-define-key :keymaps 'flyspell-mouse-map
                        "<mouse-3>" #'ispell-word
                        "<mouse-2>" nil)
    (general-define-key :keymaps 'evil-motion-state-map
                        "zz" #'ispell-word)
    )

  (use-package flyspell-correct
    :after flyspell
    :bind (:map flyspell-mode-map ("C-;" . flyspell-correct-wrapper)))

  (use-package flyspell-correct-ivy
    :after flyspell-correct)
#+END_SRC
** Evil-Anzu (search and replace)
#+BEGIN_SRC emacs-lisp 
  (use-package evil-anzu :defer t)
#+END_SRC
** Clipboard (simpleclip)
#+BEGIN_SRC emacs-lisp 
  (use-package simpleclip
    :config
    (simpleclip-mode 1))

  ;; Allows pasting in minibuffer with M-v
  (add-hook 'minibuffer-setup-hook 'jib/paste-in-minibuffer)

  ;; From http://blog.binchen.org/posts/the-reliable-way-to-access-system-clipboard-from-emacs.html
  ;; Uses simpleclip
  (defun jib/paste-in-minibuffer ()
    (local-set-key (kbd "M-v") 'simpleclip-paste))
#+END_SRC
** Undo/Redo (undofu)
More obvious/easy to use undo and redo.
#+BEGIN_SRC emacs-lisp 
  (use-package undo-fu)
#+END_SRC
** Super-save
#+BEGIN_SRC emacs-lisp 
  (use-package super-save
    :diminish super-save-mode
    :defer 2
    :config
    (setq super-save-auto-save-when-idle t
          super-save-idle-duration 5 ;; after 5 seconds of not typing autosave
          super-save-triggers ;; Functions after which buffers are saved (switching window, for example)
          '(evil-window-next evil-window-prev balance-windows other-window)
          super-save-max-buffer-size 10000000)
    (super-save-mode +1))

  ;; After super-save autosaves, wait __ seconds and then clear the buffer. I don't like
  ;; the save message just sitting in the echo area.
  (defun jib-clear-echo-area-timer ()
    (run-at-time "2 sec" nil (lambda () (message " "))))

  (advice-add 'super-save-command :after 'jib-clear-echo-area-timer)
#+END_SRC
** Saveplace
#+BEGIN_SRC emacs-lisp 
  (use-package saveplace
    :init (setq save-place-limit 100)
    :config (save-place-mode))
#+END_SRC
** Yasnippet
#+BEGIN_SRC emacs-lisp 
  (use-package yasnippet
    :diminish yas-minor-mode
    :defer 5
    :config
    (setq yas-snippet-dirs (list (expand-file-name "snippets" jib/emacs-stuff)))
    (yas-global-mode 1)) ;; or M-x yas-reload-all if you've started YASnippet already.


  ;; Silences the warning when running a snippet with backticks (runs a command in the snippet)
  ;; I use backtick commands to get the date for org snippets
  (require 'warnings)
  (add-to-list 'warning-suppress-types '(yasnippet backquote-change)) 
#+END_SRC

* Visuals
** Fonts
*** Font configuration
#+BEGIN_SRC emacs-lisp 
  (setq text-scale-mode-step 1.1) ;; How much to adjust text scale by when using `text-scale-mode'
  (setq jib-default-line-spacing 0) ;; This happens in the variables but I guess I have it here too.

  (setq-default line-spacing jib-default-line-spacing)

  ;; Setting text size based on the computer I am on.
  (if (eq jib/computer 'laptop)
      (setq jib-text-height 140))
  (if (eq jib/computer 'desktop)
      (setq jib-text-height 150))

  (set-face-attribute 'default nil :family "Jetbrains Mono" :weight 'medium :height jib-text-height)

  ;; Float height value (1.0) makes fixed-pitch take height 1.0 * height of default
  ;; This means it will scale along with default when the text is zoomed
  (set-face-attribute 'fixed-pitch nil :font "Roboto Mono" :weight 'regular :height 1.0)

  ;; Height of 160 seems to match perfectly with 12-point on Google Docs
  ;; (set-face-attribute 'variable-pitch nil :family "Times New Roman" :height 160)

  (set-face-attribute 'variable-pitch nil :slant 'normal :weight 'normal :height 160 :width 'normal :foundry "nil" :family "Nunito")
  #+END_SRC
*** mixed-pitch
A better version of variable-pitch mode. This keeps certain faces (defined in ~mixed-pitch-fixed-pitch-faces~) fixed-pitch.
#+BEGIN_SRC emacs-lisp
  (use-package mixed-pitch
    :defer t
    :config
    (setq mixed-pitch-set-height nil)
    (dolist (face '(org-date org-priority org-tag org-special-keyword)) ;; Some extra faces I like to be fixed-pitch
      (add-to-list 'mixed-pitch-fixed-pitch-faces face)))
#+END_SRC
** Modeline
#+BEGIN_SRC emacs-lisp 
  ;; Disables showing system load in modeline, useless anyway
  (setq display-time-default-load-average nil)

  (line-number-mode)
  (column-number-mode)
  (display-time-mode -1)
  (size-indication-mode 1)

  (use-package hide-mode-line
    :commands (hide-mode-line-mode))

  (use-package doom-modeline
    :config
    (doom-modeline-mode)
    (setq doom-modeline-buffer-file-name-style 'auto ;; Just show file name (no path)
          doom-modeline-enable-word-count t
          doom-modeline-buffer-encoding nil
          doom-modeline-icon t ;; Enable/disable all icons
          doom-modeline-modal-icon nil ;; Icon for Evil mode
          doom-modeline-major-mode-icon t
          doom-modeline-major-mode-color-icon nil
          doom-modeline-bar-width 3))

  ;; Configure modeline text height based on the computer I'm on.
  ;; These variables are used in the Themes section to ensure the modeline
  ;; stays the right size no matter what theme I use.
  (if (eq jib/computer 'laptop)
      (setq jib-doom-modeline-text-height 135) ;; If laptop
    (setq jib-doom-modeline-text-height 140))  ;; If desktop

  (if (eq jib/computer 'laptop)
      (setq doom-modeline-height 25) ;; If laptop
    (setq doom-modeline-height 28))  ;; If desktop
#+END_SRC
** Window features
*** Window
#+BEGIN_SRC emacs-lisp 
  ;; Window's initial size and a bit of border
  (if (eq jib/computer 'laptop)
      (setq default-frame-alist '((left . 150)
                                  (width . 120)
                                  (fullscreen . fullheight)
                                  ;; (vertical-scroll-bars . nil) ;; Think this isn't needed
                                  (internal-border-width . 8))))

  (if (eq jib/computer 'desktop)
      (setq default-frame-alist '((left . 170)
                                  (width . 173)
                                  (top . 64)
                                  (height . 53)
                                  (fullscreen . fullheight)
                                  (internal-border-width . 8))))

  ;; (frame-parameter nil 'left)
#+END_SRC
*** Default Emacs features
Hides scroll, toolbar. Goes to the early-init.el.
#+BEGIN_SRC emacs-lisp :tangle ./early-init.el
  ;; Window configuration
  (setq frame-inhibit-implied-resize t) ;; Supposed to hasten startup

  ;; Less clutter (this is what dfrosted12 uses so I trust that)
  (add-to-list 'default-frame-alist '(tool-bar-lines . 0))
  (add-to-list 'default-frame-alist '(menu-bar-lines . 0))
  (add-to-list 'default-frame-alist '(vertical-scroll-bars))

  ;; This makes the Aqua titlebar color the same as Emacs.
  (add-to-list 'default-frame-alist '(ns-transparent-titlebar . t))
#+END_SRC
